export function License() {
  return (
    <section className="section">
      <div className="container">
          <h1 className="license-title">
              <span>1602 ВКГ</span>
              <span className="license-title-green">лицензии</span>
          </h1>
      </div>

      <div className="license-description-little container">
        <span>о госпитале</span>
        <span><img src="circle"/>лицензии</span>
      </div>
      
      <div className="license-description-more container">
        <p>Информация об осуществляемой медицинской деятельности (копии (электронные образцы) лицензий на все виды деятельности)</p>
      </div>
      
      <div className="license-list container">
        <a><img src="img-doc"/>Лицензия ФС-61–01–002367 от 30.04.2020 г.</a>
        <a><img src="img-doc"/>Приложение № 1 к лицензии ФС-61–01–002367 от 30.04.2020 г.</a>
        <a><img src="img-doc"/>Приложение № 2 к лицензии ФС-61–01–002367 от 30.04.2020 г.</a>
        <a><img src="img-doc"/>Приложение № 3 к лицензии ФС-61–01–002367 от 30.04.2020 г.</a>
        <a><img src="img-doc"/>Приложение № 4 к лицензии ФС-61–01–002367 от 30.04.2020 г.</a>
        <a><img src="img-doc"/>Приложение № 5 к лицензии ФС-61–01–002367 от 30.04.2020 г.</a>
        <a><img src="img-doc"/>Приложение № 6 к лицензии ФС-61–01–002367 от 30.04.2020 г.</a>
        <a><img src="img-doc"/>Приложение № 7 к лицензии ФС-61–01–002367 от 30.04.2020 г.</a>
        <a><img src="img-doc"/>Приложение № 8 к лицензии ФС-61–01–002367 от 30.04.2020 г.</a>
        <p>Лицензия № ФС — 61–02–000258 от 20 апреля 2015г. на осуществление фармацевтической деятельности, выданная Федеральной службой по надзору в сфере здравоохранения, бессрочно</p>
        <p>Лицензия № ФС-61–03–000013 от 10.06.2016г. на деятельность по обороту наркотических средств, психотропных веществ и их прекурсоров, культивирования наркосодержащих растений, выданная Федеральной службой по надзору в сфере здравоохранения, бессрочно</p>
        <p>Лицензия № ЛО-61–03–000279 от 18 ноября 2016г. на деятельность по обороту наркотических средств, психотропных веществ и их прекурсоров, культивирования наркосодержащих растений, выданная Министерством здравоохранения Ростовской области, бессрочно</p>
      </div>
    </section>
  );
}