import { useState } from 'react';

import './History.css';

import fourImage from '../../assets/CirclesFour.svg';
import usersImage from '../../assets/UsersFour.svg';
import swapImage from '../../assets/Swap.svg';
import flagImage from '../../assets/FlagBanner.svg';
import barsImage from '../../assets/ChartBar.svg';
import manySoldiersImage from '../../assets/history-many-soldiers.svg';
import historyOpenHospitalImage from '../../assets/history-open-hospital.svg';
import historyHumanImage from '../../assets/history-human.svg';

export function History() {
  const scrollToSection = (id: string) => {
    document.getElementById(id)?.scrollIntoView({
      behavior: "smooth",
      block: "start",
    });
  };

  const historyArrow = (<svg width="28" height="8" viewBox="0 0 28 8" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M10.7463 3.79443V4.29445L10.7506 4.29441L10.7463 3.79443ZM10.7463 3.79443L10.7506 4.29441L26.9151 4.15428L26.9108 3.6543L26.9065 3.15432L10.742 3.29445L10.7463 3.79443ZM3.11631 3.79443V3.29443H2.88672V3.79443V4.29443H3.11631V3.79443ZM3.11631 3.79443V4.29443H10.7463V3.79443V3.29443H3.11631V3.79443ZM27.2674 4.00477C27.461 3.80782 27.4582 3.49125 27.2613 3.29769L24.0518 0.143416C23.8549 -0.0501463 23.5383 -0.0474019 23.3448 0.149546C23.1512 0.346493 23.1539 0.663064 23.3509 0.856626L26.2037 3.66043L23.3999 6.51327C23.2064 6.71022 23.2091 7.02679 23.4061 7.22035C23.603 7.41391 23.9196 7.41117 24.1131 7.21422L27.2674 4.00477ZM-3.26633e-05 3.79443L2.88672 6.68119L5.77347 3.79443L2.88672 0.907682L-3.26633e-05 3.79443Z" fill="black"/></svg>);

  const [isHistoryOpen, setIsHistoryOpen] = useState(false);

  const svg = (<svg width="20" height="20" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M7 17L17 7M17 7H7M17 7V17" stroke="currentColor" strokeWidth="2" strokeLinecap="round" strokeLinejoin="round"/></svg>);

  return (
    <div className='history-page'>
      <section className="section">
        <div className="container">
          <h1>
            <span className='title'>1602 ВКГ</span>
            <span className='title title-green'>история медицинской организации</span>
          </h1>

          <div className="history-description-little">
            <span>о госпитале</span>
            <span><div className='history-circle'/>история медицинской организации</span>
          </div>
          
          <div className="history-description-more">
            <p>Условно исторический путь 1602 ОВКГ можно разделить на пять периодов:</p>
          </div>
        </div>
        
        <div className="history-list container">
          <div className='history-list-grid'>
            <p className='card'><img src={fourImage}/>Основание<br/>23–28 июня 1941 г.</p>
            <div>{historyArrow}</div>
            <p className='card'><img src={usersImage}/>Становление<br/>1944–2000 гг.</p>
            <div>{historyArrow}</div>
            <p className='card'><img src={swapImage}/>Реорганизация<br/>2009 г. — настоящее время</p>
            <div>{historyArrow}</div>
            <p className='card'><img src={flagImage}/>Боевой путь<br/>1941–1944 гг.</p>
            <div>{historyArrow}</div>
            <p className='card'><img src={barsImage}/>Интенсификация и развитие<br/>2000–2009 гг.</p>
          </div>
          <div className='history-list-image'>
            <img src={manySoldiersImage}/>
          </div>
        </div>

        <div className='history-more container'>
          <button type="button" className={`history-more-button ${ isHistoryOpen ? 'history-more-button--active' : '' }`} onClick={() => setIsHistoryOpen(!isHistoryOpen)} aria-expanded={isHistoryOpen} aria-controls="history-more-content">
            {isHistoryOpen ? 'свернуть' : 'подробнее'}
          </button>
          <div id="history-more-content" className={ isHistoryOpen ? 'history-more-data--open' : 'history-more-data--close' } aria-hidden={!isHistoryOpen}>
            <div className="history-more-data-inner">
              <div className="history-more-data-text">
                <p>1602 ОВКГ был сформирован по мобилизационному плану Ростовского-на-Дону горздравотдела в первые дни Великой Отечественной войны. Коллектив госпиталя был сформирован из медперсонала разных медучреждений города и области. Вспомогательные службы пополнялись за счёт гражданского персонала.</p>
                <p>В годы войны в составе Южного, Северо-Кавказского, Закавказского фронтов, Средне-Азиатского военных округов в разное время госпиталь выполнял функции сортировочного и эвакуационного госпиталя, в которых оказывалась квалифицированная и специализированная медицинская помощь раненым и больным, их сортировка и эвакуация в тыловые медицинские учреждения страны.</p>
                <p>Кроме хирургических отделений в госпитале были организованы большое терапевтическое и кожно-венерологическое (КВО) отделения. Машины в хозяйстве госпиталя не было до 1943 года. Лишь в Минеральных Водах, бывший раненый Иванов А.А., после излечения оставленный на службе в госпитале, собрал в рабочее состояние грузовую машину из брошенных немецких и советских машин. На ней работал сам в Минеральных Водах, а затем и в г. Ростове-на-Дону ещё много лет.</p>
                <p>За весь боевой путь (при осуществлении эвакуации и передислокации) госпиталь шесть раз был развёрнут в полном составе и свёрнут с погрузкой и разгрузкой имущества в эшелоны. Ответственным комендантом эшелона был инженер-капитан Шалонин В.И. Необходимость размещения в неприспособленных помещениях и развёртывания всех функциональных подразделений госпиталя в очень сжатые сроки, одномоментное поступление большого количества раненых — буквально эшелонами, при постоянном недостатке в кадрах медицинского и, особенно, обслуживающего персонала — создавали зачастую колоссальные трудности в осуществлении приёма и оказания медицинской помощи раненым, предъявляя к личному составу высочайшие требования. В эти дни люди трудились каждый за троих, порой сутками не выходя из стен госпиталя, оставляя для сна считанные часы, с честью выполняя поставленные задачи.</p>
                <p>Незаурядными организаторами в период Великой Отечественной войны проявили себя начальники госпиталя, заместители начальника госпиталя по медицинской части. Хирургическую работу госпиталя в разное время военных лет возглавляли профессоры, начальниками отделений работали опытные специалисты. Большим уважением у раненых и больных пользовались врачи и медсёстры, которым обязаны жизнью тысячи спасённых раненых и больных. Политруки вселяли уверенность, силу, мужество, делили со всеми бессонные ночи, усталость, нервное перенапряжение.</p>
                <p>В конце 1944 г. — начале 1945 г. все госпитали, сформированные по мобилизационному плану Ростовского-на-Дону горздравотдела, были расформированы, кроме 1602 СЭГ (зарекомендовал себя одним из лучших). Госпиталь был переведён в статус окружного и одновременно гарнизонного военного госпиталя с прежним номером 1602 в составе Военно-санитарного управления СКВО (штат 400 коек) и размещался в помещении одной из больниц Пролетарского района города (на 14-й линии). Условия работы в это время были трудные, многие лечебные отделения размещались в тесных и малоудобных зданиях. Коллектив госпиталя провёл большую работу по благоустройству зданий и территории, созданию уюта для больных. Однако существовавшие тогда условия размещения не давали возможности для коренного улучшения культуры обслуживания больных и в целом всего лечебного процесса.</p>
                <p>В связи с этим по инициативе начальника Военномедицинского отдела СКВО Шопена И.П. начались работы по восстановлению зданий бывшего военного госпиталя на окраине города по Таганрогскому шоссе.</p>
                <p>Летом 1952 г. для окружного военного госпиталя было восстановлено здание главного лечебного корпуса, куда в июле 1953 г. были переведены основные лечебные отделения.</p>
                <p>В 1955 г. построен новый 2-х этажный корпус инфекционного и туберкулёзного отделений. В 1957 г. введено в строй 2-х этажное здание управления госпиталя. В 1961 г. — барачного типа здание для психиатрического отделения. В 1962 г. в цокольном этаже основного корпуса размещены и оборудованы помещения водогрязелечебницы физиотерапевтического отделения. В 1964 г. — в типовом казарменном корпусе за счёт переустройства были размещены отоларингологическое и глазное отделения. В 1966 г. построена новая кухня-столовая на 300 посадочных мест.</p>
                <p>В 1968 г. введена в строй новая аптека, библиотека. В начале 1974 г. было построено и сдано в эксплуатацию современное 4_х этажное здание хирургического корпуса на 200 коек.</p>
              </div>
              <div className='history-more-data-grid'>
                <div className='history-more-data-grid-image'>
                  <img src={historyHumanImage}/>
                </div>
                <div className='history-more-data-grid-text'>
                  <p>24 марта 1984 г. после соответствующего ремонта и перепланировки сборно-каркасного здания барачного типа был сдан корпус психиатрического отделения на 40 коек. В 1993 г. — отдельный корпус для кожно-венерологического отделения</p>
                  <p>8 мая 2000 г. открыт и сдан в эксплуатацию новый современный терапевтический корпус на 150 коек с развёртыванием кардиологического центра на 85 коек</p>
                  <p>В 2008 г. закончилось строительство 7-этажного лечебно-диагностического корпуса на 245 коек с надстройкой для актового зала на 250 мест</p>
                  <p>В настоящее время возглавляет госпиталь к.м.н., полковник медицинской службы Крайнюков П.Е., заместитель начальника по медицинской части — полковник медицинской службы Попов А.В. В госпитале в разное время служили и работали (некоторые продолжают плодотворно трудиться и сегодня) заслуженные врачи РФ: Харагезов М.М., Гекимян И.К., Вечернин Н.М., Барцевич Б.Н., Богучарский, В.М., Корзан Д.П., Мелещенко Д.П., Горовиц С.Г., к.м.н. Локоть П.Я., Селиванов В.И., Аршанский Ш.С., д.м.н. Соломин А.Н., Аблязин У.С., Логвиненко А.И., Власов А.С., Чуйко В.И., д.м.н. Ан Р.Н., Моисеенко А.И., Ватаманюк В.П., Абаев Г.Т., Шейко А.В., д.м.н. Багмет А.Д., Татарин С.Н.; заслуженный работник здравоохранения РФ — канд. фарм. наук Давидов С.Б. и др.</p>
                </div>
              </div>
            </div>
          </div>
        </div>

        <div className="about-contacts">
          <div className="container">
            <h1><span className='title title-thin'>ЗНАМЕНАТЕЛЬНЫЕ ДАТЫ И СОБЫТИЯ 1602 ОВКГ:</span></h1>
            <div className="contacts-grid">
              <div className="history-open-hospital"><img src={historyOpenHospitalImage}/></div>
              <div className="contacts-list">
                <a className='base-link' onClick={() => scrollToSection("contacts")}>1964{svg}</a>
                <a className='base-link' onClick={() => scrollToSection("contacts")}>1970{svg}</a>
                <a className='base-link' onClick={() => scrollToSection("contacts")}>1972{svg}</a>
                <a className='base-link' onClick={() => scrollToSection("contacts")}>1977{svg}</a>
                <a className='base-link' onClick={() => scrollToSection("contacts")}>1989-1990{svg}</a>
                <a className='base-link' onClick={() => scrollToSection("contacts")}>2000{svg}</a>
                <a className='base-link' onClick={() => scrollToSection("contacts")}>2002{svg}</a>
                <a className='base-link' onClick={() => scrollToSection("contacts")}>2009-2010{svg}</a>
              </div>
            </div>
          </div>
        </div>
      </section>
    </div>
  );
}